app/Helpers/CIFunctions_Helper.php

    function get_user(){
      if( CIAuth::check() ){
        $user = new UsersModel();
        return $user->asObject()->where('id', CIAuth::id())->first();
---
SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1

   function get_settings(){
    $settings = new SettingsModel();
    $settings_data = $settings->asObject()->first();
---
SELECT *
FROM `settings`
 LIMIT 1